from pymongo import MongoClient

# Define reusable activity function
def activity(description, period, time_range ,done):
    return {
        "description": description,
        "period": period,
        "time_range": time_range,
        "done":done
    }

# Set the custom user ID


# Define all documents
docs = [
    {
        "day": "Day 1",
        "activities": [
            activity("সূর্যের আলোয় ৪ ঘণ্টা বীজ শুকিয়ে নিন।", "সকাল", "৭টা – ১২টা",False),
            activity("স্বাভাবিক তাপমাত্রায় বীজকে ঠান্ডা করে নিন।", "দুপুর", "১২টা – ৪টা",False),
            activity("পানিতে ৬ ঘণ্টা ভিজিয়ে রাখুন।", "বিকাল – রাত", "৪টা – ১০টা",False),
        ],
        "extra_work":[]
    },
    {
        "day": "Day 2",
        "activities": [
            activity("প্রতি কেজি বীজের সাথে ১০ গ্রাম ট্রাইকোডার্মা মিশিয়ে নিন।", "সকাল", "৬টা – ৭টা",False),
            activity("বীজকে শুকিয়ে নিন (সরাসরি সূর্যের তাপ দেয়া যাবেনা)", "সকাল", "৭টা – ১০টা",False),
            activity("বীজকে ২গ্রাম/লিটার জিবেরেলিক এসিড (GA3 10%) মিশ্রনে ১০ মিনিট ডুবিয়ে রেখে বাতাসে শুকিয়ে নিন।", "সকাল", "১০টা – ১১টা",False),
            activity("একটি হালকা আর্দ্র কাপড়ে বীজ বেঁধে পুত্তলি বানিয়ে ২১ ঘণ্টা শুষ্ক জায়গায় রাখুন।", "সকাল", "১১টা – ৮টা",False),
        ],
        "extra_work":[]
    },
    {
        "day": "Day 3",
        "activities": [
            activity("বীজ বপন করুন এবং ছায়াযুক্ত স্থানে রাখুন।", "সকাল", "৬টা – ৮টা",False),
            activity("বীজ বপনের সময় অঙ্কুরোদ্গম না", "সকাল", "৬টা – ৮টা",False),
        ],
        "special_statements": {
            "procedure": "বীজ বপন পদ্ধতিঃ বীজকে প্রথমে অঙ্কুরোদ্গম করে নিতে হবে...",
            "warning": "সতর্কীকরণঃ চারার সুস্থ বৃদ্ধির জন্য শিডিউল স্প্রে..."
        },
        "extra_work":[]
    },
    {
        "day": "Seed Day 01",
        "activities": [
            activity("দমন ব্যবস্থাপনা ---> কল্যাণ ৩ গ্রাম/লিটার + নেয়ামত ০.৫গ্রাম/লিটার", "সকাল", "৭-৮টা",False),
            activity("পরিচর্যা ---> কোন চারা রোগাক্রান্ত হলে তা দ্রুত তুলে ফেলুন...", "সকাল", "৯-১১টা",False),
        ],
        "extra_work":[]

    },
    {
        "day": "Seed Day 02",
        "activities": [
            activity("দমন ব্যবস্থাপনা ---> কল্যাণ ৩ গ্রাম/লিটার + নেয়ামত ০.৫গ্রাম/লিটার", "সকাল", "৭-৮টা",False),
            activity("পরিচর্যা ---> কোন চারা রোগাক্রান্ত হলে তা দ্রুত তুলে ফেলুন...", "সকাল", "৯-১১টা",False),
        ],
        "extra_work":[]

    },
    {
        "day": "Seed Day 03",
        "activities": [
            activity("দমন ব্যবস্থাপনা ---> কল্যাণ ৩ গ্রাম/লিটার + নেয়ামত ০.৫গ্রাম/লিটার", "সকাল", "৭-৮টা",False),
            activity("পরিচর্যা ---> কোন চারা রোগাক্রান্ত হলে তা দ্রুত তুলে ফেলুন...", "সকাল", "৯-১১টা",False),
        ],
        "extra_work":[]

    },
    {
        "day": "Seed Day 04",
        "activities": [
            activity("দমন ব্যবস্থাপনা ---> কল্যাণ ৩ গ্রাম/লিটার + নেয়ামত ০.৫গ্রাম/লিটার", "সকাল", "৭-৮টা",False),
            activity("পরিচর্যা ---> কোন চারা রোগাক্রান্ত হলে তা দ্রুত তুলে ফেলুন...", "সকাল", "৯-১১টা",False),
        ],
        "extra_work":[]

    },
    {
        "day": "Seed Day 05",
        "activities": [
            activity("দমন ব্যবস্থাপনা ---> ক্রপ মাস্টার ৫ গ্রাম/লিটার + ম্যাট্রিক্সিন ১ মিলি/লিটার", "সকাল", "৭-৮টা",False),
            activity("পরিচর্যা ---> কোন চারা রোগাক্রান্ত হলে তা দ্রুত তুলে ফেলুন...", "সকাল", "৯-১১টা",False),
        ],
        "extra_work":[]
    },
    {
        "day": "Seed Day 06",
        "activities": [
            activity("দমন ব্যবস্থাপনা ---> ক্রপ মাস্টার ৫ গ্রাম/লিটার + ম্যাট্রিক্সিন ১ মিলি/লিটার", "সকাল", "৭-৮টা",False),
            activity("পরিচর্যা ---> কোন চারা রোগাক্রান্ত হলে তা দ্রুত তুলে ফেলুন...", "সকাল", "৯-১১টা",False),
        ],
        "extra_work":[]
    },
    {
        "day": "Seed Day 07",
        "activities": [
            activity("পরিচর্যা ---> কোন চারা রোগাক্রান্ত হলে তা দ্রুত তুলে ফেলুন...", "সকাল", "৯-১১টা",False),
        ],
        "extra_work":[]
    },
    {
        "day": "Seed Day 08",
        "activities": [
            activity("পরিচর্যা ---> কোন চারা রোগাক্রান্ত হলে তা দ্রুত তুলে ফেলুন...", "সকাল", "৯-১১টা",False),
        ],
        "extra_work":[]
    },
    {
        "day": "Seed Day 09",
        "activities": [
            activity("পরিচর্যা ---> কোন চারা রোগাক্রান্ত হলে তা দ্রুত তুলে ফেলুন...", "সকাল", "৯-১১টা",False),
        ],
        "extra_work":[]
    },
    {
        "day": "Seed Day 10",
        "activities": [
            activity("দমন ব্যবস্থাপনা ---> কল্যান ৩ গ্রাম/লিটার + প্রোফাইটা ১ মিলি/লিটার + ইয়োকা ১ মিলি/লিটার", "সকাল", "৭-৮টা",False),
            activity("পরিচর্যা ---> কোন চারা রোগাক্রান্ত হলে তা দ্রুত তুলে ফেলুন...", "সকাল", "৯-১১টা",False),
        ],
        "extra_work":[]
    },
    {
        "day": "Seed Day 11",
        "activities": [
            activity("দমন ব্যবস্থাপনা ---> কল্যান ৩ গ্রাম/লিটার + প্রোফাইটা ১ মিলি/লিটার + ইয়োকা ১ মিলি/লিটার", "সকাল", "৭-৮টা",False),
            activity("পরিচর্যা ---> কোন চারা রোগাক্রান্ত হলে তা দ্রুত তুলে ফেলুন...", "সকাল", "৯-১১টা",False),
        ],
        "extra_work":[]
    },
    {
        "day": "Seed Day 12",
        "activities": [
            activity("পরিচর্যা ---> কোন চারা রোগাক্রান্ত হলে তা দ্রুত তুলে ফেলুন... চারার গোড়ার আগাছা তোলাঃ...", "সকাল", "৯-১১টা",False),
        ],
        "extra_work":[]
    },
    {
        "day": "Seed Day 13",
        "activities": [
            activity("পরিচর্যা ---> কোন চারা রোগাক্রান্ত হলে তা দ্রুত তুলে ফেলুন... চারার গোড়ার আগাছা তোলাঃ...", "সকাল", "৯-১১টা",False),
        ],
        "extra_work":[]
    },
    {
        "day": "Seed Day 14",
        "activities": [
            activity("পরিচর্যা ---> কোন চারা রোগাক্রান্ত হলে তা দ্রুত তুলে ফেলুন... চারার গোড়ার আগাছা তোলাঃ...", "সকাল", "৯-১১টা",False),
        ],
        "extra_work":[]
    },
    {
        "day": "Seed Day 15",
        "activities": [
            activity("দমন ব্যবস্থাপনা ---> গ্রিন প্লাস ১মিলি/লিটার + চিলেটেট জিঙ্ক ০.৫ গ্রাম/লিটার", "সকাল", "৭-৮টা",False),
            activity("পরিচর্যা ---> কোন চারা রোগাক্রান্ত হলে তা দ্রুত তুলে ফেলুন...", "সকাল", "৯-১১টা",False),
        ],
        "extra_work":[]
    },
    {
        "day": "Seed Day 16",
        "activities": [
            activity("দমন ব্যবস্থাপনা ---> গ্রিন প্লাস ১মিলি/লিটার + চিলেটেট জিঙ্ক ০.৫ গ্রাম/লিটার", "সকাল", "৭-৮টা",False),
            activity("পরিচর্যা ---> কোন চারা রোগাক্রান্ত হলে তা দ্রুত তুলে ফেলুন...", "সকাল", "৯-১১টা",False),
        ],
        "extra_work":[]
    },
    {
        "day": "Seed Day 17",
        "activities": [
            activity("উপরি সার প্রয়োগ ----> ১ম কিস্তি উপরি সার প্রয়োগঃ DAP – ২০০ গ্রাম/শতক + TSP – ১৫০গ্রাম/শতক", "সকাল", "৮-৯.৩০টা",False),
            activity("পরিচর্যা ---> কোন চারা রোগাক্রান্ত হলে তা দ্রুত তুলে ফেলুন...", "সকাল", "৯-১১টা",False),
        ],
        "extra_work":[]
    },
    {
        "day": "Seed Day 18",
        "activities": [
            activity("উপরি সার প্রয়োগ ----> ১ম কিস্তি উপরি সার প্রয়োগঃ DAP – ২০০ গ্রাম/শতক + TSP – ১৫০গ্রাম/শতক", "সকাল", "৮-৯.৩০টা",False),
            activity("পরিচর্যা ---> কোন চারা রোগাক্রান্ত হলে তা দ্রুত তুলে ফেলুন...", "সকাল", "৯-১১টা",False),
        ],
        "extra_work":[]
    },
    {
        "day": "Seed Day 19",
        "activities": [
            activity("পরিচর্যা ---> কোন চারা রোগাক্রান্ত হলে তা দ্রুত তুলে ফেলুন... চারার গোড়ার আগাছা তোলাঃ...", "সকাল", "৯-১১টা",False),
        ],
        "extra_work":[]
    },
    {
        "day": "Seed Day 20",
        "activities": [
            activity("দমন ব্যবস্থাপনা ---> কপাল ২ গ্রাম/লিটার + নেয়ামত ০.৫ গ্রাম/লিটার", "সকাল", "৭-৮টা",False),
            activity("পরিচর্যা ---> কোন চারা রোগাক্রান্ত হলে তা দ্রুত তুলে ফেলুন...", "সকাল", "৯-১১টা",False),
        ],
        "extra_work":[]
    },
    {
        "day": "Seed Day 21",
        "activities": [
            activity("দমন ব্যবস্থাপনা ---> কপাল ২ গ্রাম/লিটার + নেয়ামত ০.৫ গ্রাম/লিটার", "সকাল", "৭-৮টা",False),
            activity("পরিচর্যা ---> কোন চারা রোগাক্রান্ত হলে তা দ্রুত তুলে ফেলুন...", "সকাল", "৯-১১টা",False),
        ],
        "extra_work":[]
    },
    {
        "day": "Seed Day 22",
        "activities": [
            activity("দমন ব্যবস্থাপনা ---> কপাল ২ গ্রাম/লিটার + নেয়ামত ০.৫ গ্রাম/লিটার", "সকাল", "৭-৮টা",False),
            activity("পরিচর্যা ---> কোন চারা রোগাক্রান্ত হলে তা দ্রুত তুলে ফেলুন...", "সকাল", "৯-১১টা",False),
        ],
        "extra_work":[]
    },
    {
        "day": "Seed Day 23",
        "activities": [
            activity("দমন ব্যবস্থাপনা ---> কপাল ২ গ্রাম/লিটার + নেয়ামত ০.৫ গ্রাম/লিটার", "সকাল", "৭-৮টা",False),
            activity("পরিচর্যা ---> কোন চারা রোগাক্রান্ত হলে তা দ্রুত তুলে ফেলুন...", "সকাল", "৯-১১টা",False),
        ],
        "extra_work":[]
    },
    {
        "day": "Seed Day 24",
        "activities": [
            activity("দমন ব্যবস্থাপনা ---> কপাল ২ গ্রাম/লিটার + নেয়ামত ০.৫ গ্রাম/লিটার", "সকাল", "৭-৮টা",False),
            activity("পরিচর্যা ---> কোন চারা রোগাক্রান্ত হলে তা দ্রুত তুলে ফেলুন...", "সকাল", "৯-১১টা",False),
        ],
        "extra_work":[]
    },
    {
        "day": "Seed Day 25",
        "activities": [
            activity("দমন ব্যবস্থাপনা ---> গ্রিন প্লাস ১মিলি/লিটার + চিলেটেট জিঙ্ক ০.৫ গ্রাম/লিটার", "সকাল", "৭-৮টা",False),
            activity("পরিচর্যা ---> কোন চারা রোগাক্রান্ত হলে তা দ্রুত তুলে ফেলুন...", "সকাল", "৯-১১টা",False),
        ],
        "extra_work":[]
    },
    {
        "day": "Seed Day 26",
        "activities": [
            activity("পরিচর্যা ---> কোন চারা রোগাক্রান্ত হলে তা দ্রুত তুলে ফেলুন... চারার গোড়ার আগাছা তোলাঃ...", "সকাল", "৯-১১টা",False),
        ],
        "extra_work":[]
    },
    {
        "day": "Seed Day 27",
        "activities": [
            activity("পরিচর্যা ---> কোন চারা রোগাক্রান্ত হলে তা দ্রুত তুলে ফেলুন... চারার গোড়ার আগাছা তোলাঃ...", "সকাল", "৯-১১টা",False),
        ],
        "extra_work":[]
    },
    {
        "day": "Seed Day 28",
        "activities": [
            activity("পরিচর্যা ---> কোন চারা রোগাক্রান্ত হলে তা দ্রুত তুলে ফেলুন... চারার গোড়ার আগাছা তোলাঃ...", "সকাল", "৯-১১টা",False),
        ],
        "extra_work":[]
    },
    {
        "day": "Seed Day 29",
        "activities": [
            activity("পরিচর্যা ---> কোন চারা রোগাক্রান্ত হলে তা দ্রুত তুলে ফেলুন... চারার গোড়ার আগাছা তোলাঃ...", "সকাল", "৯-১১টা",False),
        ],
        "extra_work":[]
    },
    {
        "day": "Seed Day 30",
        "activities": [
            activity("দমন ব্যবস্থাপনা ---> সম্পদ ১.৫ গ্রাম/লিটার + ইয়োকো ১ মিলি/লিটার + স্টারথেন ১ গ্রাম/লিটার", "সকাল", "৭-৮টা",False),
            activity("পরিচর্যা ---> কোন চারা রোগাক্রান্ত হলে তা দ্রুত তুলে ফেলুন...", "সকাল", "৯-১১টা",False),
        ],
        "extra_work":[]
    }
]

# Connect to your MongoDB Atlas cluster
client = MongoClient("mongodb+srv://ifty:nxzhhhlWutt7PcMh@cluster0.bd9ywas.mongodb.net/mydatabase?retryWrites=true&w=majority&appName=Cluster0")
db = client["mydatabase"]
collection = db["daywise_instructions"]

# Optional: Clear previous data
collection.delete_many({})

# Insert all documents
collection.insert_many(docs)

print("✅ All documents successfully inserted into MongoDB Atlas!")
